# DBDiagnose

## Description
Test ODBC connectivity and creates log file in application folder. Returns true if succeeded.

```pascal
FUNCTION DBDiagnose : BOOLEAN;
```

```python

def vs.DBDiagnose():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2015
## Category
* ODBC